scripts/global/1608/32866653

<p>Having a question(trying to make first xml request). Data provider provides only with SOAP service for xml requests. It does not provide any additional data, what is the best way to write xml request using python? And how should it look like? Wanted to do it with <code>suds</code> but did not get how to put xml request into it as no wsdl data is given(also no login info provided). Could you guys help for newbie?:) Here is xml request data(only data what providers gives) :</p>  <p><div class="snippet" data-lang="js" data-hide="false"> <div class="snippet-code"> <pre class="snippet-code-html lang-html prettyprint-override"><code>&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:ec.europa.eu:taxud:vies:services:checkVat:types"&gt;    &lt;soapenv:Header/&gt;    &lt;soapenv:Body&gt;       &lt;urn:checkVat&gt;          &lt;urn:countryCode&gt;MS&lt;/urn:countryCode&gt;          &lt;urn:vatNumber&gt;TESTVATNUMBER&lt;/urn:vatNumber&gt;       &lt;/urn:checkVat&gt;    &lt;/soapenv:Body&gt; &lt;/soapenv:Envelope&gt;</code></pre> </div> </div> </p>